<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="msvalidate.01" content="882A4E15FB483D0DD65BAC2CD6F114BD"><meta name="description" content="Wing's Blog"><title>Wing | 大道至简</title><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/8.0.0/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/1.0.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/1.0.0/grids-responsive-min.css"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.7.0/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/3.3.1/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">Wing</h1><a id="logo" href="/.">Wing</a><p class="description">大道至简</p></div><div id="nav-menu"><a class="current" href="/."><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/books/"><i class="fa fa-book"> 书籍</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div class="pure-g" id="layout"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title"><a href="/2018/10/06/redis/">深入理解Redis</a></h1><div class="post-meta">2018-10-06</div><div class="post-content"><p>
&#x521A;&#x5F00;&#x59CB;&#x53EA;&#x662F;&#x4F7F;&#x7528;&#x60F3;&#x5B66;&#x4E60;&#x4E00;&#x79CD;&#x7528;&#x505A;&#x7F13;&#x5B58;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8FB9;&#x770B;&#x89C6;&#x9891;&#xFF0C;&#x8FB9;&#x7FFB;&#x9605;&#x5B98;&#x65B9;&#x7684;&#x6587;&#x6863;&#x624D;&#x53D1;&#x73B0;Redis&#x5982;&#x6B64;&#x5F3A;&#x5927;&#x3002;Redis&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x652F;&#x6301;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F60;&#x53EA;&#x80FD;&#x7ED9;&#x5B57;&#x7B26;&#x7C7B;&#x578B;&#x7684;&#x952E;&#x7ED1;&#x5B9A;&#x5B57;&#x7B26;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x5728;Redis&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED1;&#x5B9A;&#x5230;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;
</p></div><p class="readmore"><a href="/2018/10/06/redis/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2018/10/03/逆向PT632_G2光猫固件/">逆向PT632 G2光猫固件</a></h1><div class="post-meta">2018-10-03</div><div class="post-content"><p>
&#x56FD;&#x5E86;&#x56DE;&#x8001;&#x5BB6;&#xFF0C;&#x770B;&#x5230;&#x7237;&#x7237;&#x4E00;&#x4E2A;&#x4EBA;&#x770B;IPTV&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9065;&#x63A7;&#x6309;&#x9519;&#x4E86;&#x5C31;&#x770B;&#x4E0D;&#x4E86;&#x7535;&#x89C6;&#x4E86;&#xFF0C;&#x7237;&#x7237;&#x5E74;&#x7EAA;&#x5927;&#x4E86;&#xFF0C;&#x8033;&#x6735;&#x4E5F;&#x4E0D;&#x597D;&#x4F7F;&#x4E86;&#xFF0C;&#x7ED9;&#x4ED6;&#x4E70;&#x7684;&#x667A;&#x80FD;&#x624B;&#x673A;&#x4E5F;&#x4E0D;&#x4F1A;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x53EA;&#x61C2;&#x5F97;&#x53D1;&#x8D77;&#x5FAE;&#x4FE1;&#x89C6;&#x9891;&#xFF0C;&#x6211;&#x6253;&#x56DE;&#x53BB;&#x8FD8;&#x4E0D;&#x61C2;&#x5982;&#x4F55;&#x63A5;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x771F;&#x662F;&#x6709;&#x8BDD;&#x90FD;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x3002;&#x8D81;&#x7740;&#x653E;&#x5047;&#x51E0;&#x5929;&#xFF0C;&#x6211;&#x5C31;&#x9006;&#x5411;&#x4E86;PT632 G2&#x5149;&#x732B;&#x7684;&#x56FA;&#x4EF6;&#xFF0C;&#x5B9E;&#x73B0;&#x8FDC;&#x7A0B;&#x63A7;&#x5236;&#x5BB6;&#x91CC;&#x7684;&#x6240;&#x6709;&#x8054;&#x7F51;&#x8BBE;&#x5907;&#xFF0C;&#x4EE5;&#x540E;&#x518D;&#x8DDF;&#x6211;&#x8BF4;&#x7535;&#x89C6;&#x770B;&#x4E0D;&#x4E86;&#xFF0C;&#x6211;&#x76F4;&#x63A5;&#x8FDC;&#x7A0B;&#x64CD;&#x4F5C;&#x4E00;&#x4E0B;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;
</p></div><p class="readmore"><a href="/2018/10/03/逆向PT632_G2光猫固件/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2018/10/02/把镜像从KVM迁移到VirtualBox/">把镜像从KVM迁移到VirtualBox</a></h1><div class="post-meta">2018-10-02</div><div class="post-content"><p>
Qemu&#x662F;&#x4F7F;&#x7528;KVM&#x5185;&#x6838;&#x6A21;&#x5757;&#x52A0;&#x901F;&#x7684;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x7528;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x9886;&#x57DF;&#x6027;&#x80FD;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#xFF0C;&#x8D44;&#x6E90;&#x6D88;&#x8017;&#x8FD8;&#x5F88;&#x5C0F;&#xFF0C;&#x53EF;&#x662F;&#x56FE;&#x5F62;&#x663E;&#x793A;&#x4E00;&#x76F4;&#x662F;&#x4E2A;&#x7F3A;&#x9677;&#x3002;Linux&#x684C;&#x9762;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x603B;&#x514D;&#x4E0D;&#x4E86;&#x8981;&#x5F00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x4F7F;&#x7528;Windows&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x65E0;&#x8BBA;&#x4F7F;&#x7528;spice&#x3001;vnc&#x6216;&#x8005;rdesktop&#x534F;&#x8BAE;&#x6765;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4F7F;&#x7528;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x65F6;&#x603B;&#x611F;&#x89C9;&#x4E0D;&#x591F;&#x6D41;&#x7545;&#x3002;&#x800C;VirtualBox&#x5BF9;&#x56FE;&#x5F62;&#x663E;&#x793A;&#x505A;&#x4E86;&#x4F18;&#x5316;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x65E0;&#x7F1D;&#x6A21;&#x5F0F;&#xFF0C;Windows&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#x3002;&#x672C;&#x6587;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x8FC1;&#x79FB;&#x5230;Parallels Desktop&#x3001;Vmware&#x6216;&#x8005;&#x7269;&#x7406;&#x673A;&#x7B49;&#x73AF;&#x5883;&#x4E2D;&#x3002;
</p></div><p class="readmore"><a href="/2018/10/02/把镜像从KVM迁移到VirtualBox/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2018/05/10/把开发环境装进你的口袋/">把开发环境装进你的口袋</a></h1><div class="post-meta">2018-05-10</div><div class="post-content"><p>
&#x7528;&#x7535;&#x7EB8;&#x4E66;&#x8DD1;&#x4E00;&#x4E9B;&#x5927;&#x4E00;&#x70B9;&#x7684;&#x5E94;&#x7528;&#x5F88;&#x5403;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5F3A;&#x52B2;&#x4E00;&#x70B9;&#x7684;CPU&#xFF0C;&#x6700;&#x597D;&#x662F;Intel&#x7684;CPU&#xFF0C;&#x679C;&#x7136;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x8FD8;&#x5341;&#x5206;&#x7B26;&#x5408;&#x6211;&#x7684;&#x8981;&#x6C42;&#x3002;&#x90A3;&#x5C31;&#x662F;&#x534E;&#x7855;&#x7684;zenfone2&#xFF0C;&#x867D;&#x7136;&#x5DF2;&#x7ECF;&#x662F;2015&#x5E74;&#x7684;&#x8BBE;&#x5907;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x914D;&#x7F6E;&#x975E;&#x5E38;&#x7684;&#x8C6A;&#x534E;&#xFF0C;4g&#x7684;&#x5185;&#x5B58;&#xFF0C;16-64G&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;256G&#x7684;&#x7248;&#x672C;&#xFF0C;&#x76EE;&#x524D;&#x6CA1;&#x6709;&#x89C1;&#x8FC7;&#x3002;&#x6211;&#x5728;&#x95F2;&#x9C7C;&#x4E0A;&#x7684;&#x6DD8;&#x4E86;&#x4E00;&#x4E2A;32G&#x7684;&#x7248;&#x672C;&#xFF0C;&#x6709;&#x4E86;Intel&#x7684;CPU&#x518D;&#x52A0;&#x4E0A;KVM&#x5185;&#x6838;&#xFF0C;&#x8DD1;&#x5B8C;&#x6574;&#x7248;&#x672C;&#x7684;windows&#x6216;&#x8005;Linux&#x90FD;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;raw&#x683C;&#x5F0F;&#x662F;&#x6700;&#x5FEB;&#x7684;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x955C;&#x50CF;&#x6587;&#x4EF6;&#x4F1A;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x4E0D;&#x65B9;&#x4FBF;&#x8FDB;&#x884C;&#x8FC1;&#x79FB;&#xFF0C;&#x5B89;&#x88C5;windows&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4F1A;&#x9009;&#x62E9;&#x7A0D;&#x6162;&#x4E00;&#x70B9;&#x7684;qcow2&#x683C;&#x5F0F;&#x3002;
</p></div><p class="readmore"><a href="/2018/05/10/把开发环境装进你的口袋/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2018/05/07/打造兼容BIOS和UEFI的启动盘/">打造兼容BIOS和UEFI的启动盘</a></h1><div class="post-meta">2018-05-07</div><div class="post-content"><p>
&#x6211;&#x5E76;&#x4E0D;&#x559C;&#x6B22;&#x6253;&#x6E38;&#x620F;&#xFF0C;&#x968F;&#x7740;&#x6211;&#x5BF9;Linux&#x7684;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#xFF0C;Windows&#x5BF9;&#x6211;&#x7684;&#x5438;&#x5F15;&#x529B;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x603B;&#x514D;&#x4E0D;&#x4E86;&#x9700;&#x8981;&#x7528;&#x5230;Office&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x7528;&#x4E00;&#x4E0B;Office&#x6216;&#x8005;Photoshop&#x800C;&#x5360;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#xFF0C;&#x5B9E;&#x5728;&#x662F;&#x6709;&#x70B9;&#x6D6A;&#x8D39;&#x7A7A;&#x95F4;&#xFF0C;&#x6211;&#x7684;&#x786C;&#x76D8;&#x4E00;&#x822C;&#x53EA;&#x5206;&#x51FA;&#x6765;EFI&#x548C;ext4&#x4E24;&#x4E2A;&#x5206;&#x533A;&#xFF0C;&#x6839;&#x672C;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x4F1A;&#x6709;&#x9700;&#x8981;&#x91CD;&#x88C5;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;Windows&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x662F;&#x6253;&#x5F00;Qemu&#x865A;&#x62DF;&#x673A;&#x6765;&#x4E34;&#x65F6;&#x7528;&#x4E00;&#x4E0B;&#x3002;&#x5929;&#x6709;&#x4E0D;&#x6D4B;&#x4E4B;&#x98CE;&#x4E91;&#x554A;&#xFF0C;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x7B14;&#x8BB0;&#x672C;&#x7684;&#x56FA;&#x6001;&#x786C;&#x76D8;&#x574F;&#x4E86;&#xFF0C;&#x5E78;&#x597D;&#x7B14;&#x8BB0;&#x672C;&#x8FD8;&#x5728;&#x4FDD;&#x4FEE;&#x671F;&#x5185;&#xFF0C;&#x53EF;&#x4EE5;&#x514D;&#x8D39;&#x66F4;&#x6362;&#x4E00;&#x5757;&#x65B0;&#x7684;&#x786C;&#x76D8;&#xFF0C;&#x4F46;&#x662F;&#x7CFB;&#x7EDF;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x91CD;&#x505A;&#x7684;&#xFF0C;&#x90E8;&#x5206;&#x8D44;&#x6599;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x5907;&#x4EFD;&#x4E5F;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x5728;&#x7B14;&#x8BB0;&#x672C;&#x9001;&#x4FEE;&#x7684;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x6211;&#x7528;&#x65E7;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x5148;&#x628A;&#x7CFB;&#x7EDF;&#x5B89;&#x88C5;&#x597D;&#xFF0C;&#x56DE;&#x6765;&#x518D;&#x6062;&#x590D;&#x4E00;&#x4E0B;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x72E0;&#x72E0;&#x5730;&#x6298;&#x817E;&#x4E86;&#x4E00;&#x628A;Linux&#x5404;&#x79CD;&#x5B89;&#x88C5;&#x65B9;&#x6CD5;&#x3002;&#x5BF9;&#x4E8E;&#x542F;&#x52A8;&#x76D8;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x4E00;&#x4E0B;&#x7684;&#x8981;&#x6C42;&#xFF1A;
</p></div><p class="readmore"><a href="/2018/05/07/打造兼容BIOS和UEFI的启动盘/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2017/08/09/批量下载喜马拉雅的免费专辑/">批量下载喜马拉雅的免费专辑</a></h1><div class="post-meta">2017-08-09</div><div class="post-content"><p>
&#x73B0;&#x5728;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#x79BB;&#x516C;&#x56ED;&#x5F88;&#x8FD1;&#xFF0C;&#x60F3;&#x91CD;&#x65B0;&#x62FE;&#x8D77;&#x8DD1;&#x6B65;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x8DD1;&#x6B65;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x542C;&#x70B9;&#x4E1C;&#x897F;&#x603B;&#x89C9;&#x5F97;&#x5C11;&#x4E86;&#x70B9;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x5E26;&#x7740;&#x624B;&#x673A;&#x53BB;&#x8DD1;&#x6B65;&#x53C8;&#x89C9;&#x5F97;&#x592A;&#x91CD;&#x4E86;&#xFF0C;&#x628A;ipod shuffle&#x62FF;&#x53BB;&#x8DD1;&#x6B65;&#x521A;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x82F9;&#x679C;&#x8FD9;&#x4E2A;&#x8001;&#x53E4;&#x8463;mp3&#x64AD;&#x653E;&#x5668;&#x53EA;&#x652F;&#x6301;mp3&#x683C;&#x5F0F;&#xFF0C;&#x559C;&#x9A6C;&#x62C9;&#x96C5;&#x7684;&#x4E13;&#x8F91;&#x662F;m4a&#x683C;&#x5F0F;&#xFF0C;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x8F6C;&#x7801;&#x624D;&#x80FD;&#x5B58;&#x8FDB;&#x64AD;&#x653E;&#x5668;&#x91CC;&#x9762;&#x3002;
Windows&#x5E73;&#x53F0;&#x4E0B;&#x9664;&#x4E86;itunes&#xFF0C;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x5BFC;&#x5165;&#x5DE5;&#x5177;&#xFF0C;Linux&#x5E73;&#x53F0;&#x4E0B;&#x6211;&#x4F7F;&#x7528;gtkpod&#xFF0C;&#x6BD4;&#x5B98;&#x65B9;&#x7684;itunes&#x7B80;&#x6D01;&#x5C0F;&#x5DE7;&#x591A;&#x4E86;&#x3002;&#x65E0;&#x8BBA;&#x54EA;&#x4E2A;&#x5E73;&#x53F0;&#x5BFC;&#x5165;&#x524D;&#x90FD;&#x9700;&#x8981;&#x8F6C;&#x7801;&#x4E3A;mp3&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x6211;&#x662F;&#x7528;faad&#x548C;lame&#x7EC4;&#x5408;&#x6765;&#x8FDB;&#x884C;&#x8F6C;&#x7801;&#x7684;&#xFF0C;&#x5199;&#x8FD9;&#x4E2A;&#x4E0B;&#x8F7D;&#x811A;&#x672C;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;ffmpeg&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#x3002;&#x4E0D;&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;windows 10&#x7684;&#x559C;&#x9A6C;&#x62C9;&#x96C5;fm&#x4E0B;&#x8F7D;&#x5230;&#x514D;&#x8D39;&#x4E13;&#x8F91;&#x7684;m4a&#x3002;
</p></div><p class="readmore"><a href="/2017/08/09/批量下载喜马拉雅的免费专辑/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2017/04/29/把电纸书打造成护眼开发神器/">把电纸书打造成护眼开发神器</a></h1><div class="post-meta">2017-04-29</div><div class="post-content"><p>
&#x7535;&#x5B50;&#x58A8;&#x6C34;&#x5C4F;&#x7684;&#x51FA;&#x73B0;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x798F;&#x97F3;&#xFF0C;&#x6211;&#x662F;&#x7535;&#x8111;&#x5C4F;&#x5E55;&#x7684;&#x91CD;&#x5EA6;&#x4F7F;&#x7528;&#x8005;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x5BC4;&#x671B;&#x4E8E;&#x6709;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x80FD;&#x5F00;&#x53D1;&#x51FA;&#x4E00;&#x5957;&#x7535;&#x5B50;&#x58A8;&#x6C34;&#x5C4F;&#x663E;&#x793A;&#x5668;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x5927;&#x4E0A;&#x79D1;&#x6280;&#x516C;&#x53F8;&#x53D1;&#x5E03;&#x4E86;&#x4E00;&#x6B3E;&#x4EE5;13.3&#x5BF8;&#x7684;&#x7535;&#x5B50;&#x58A8;&#x6C34;&#x663E;&#x793A;&#x5668;&#xFF0C;&#x770B;&#x5B98;&#x65B9;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x6B3E;&#x4EE4;&#x6211;&#x5FC3;&#x52A8;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x6211;&#x5F88;&#x65E9;&#x5C31;&#x8D2D;&#x5165;&#x4E86;&#x7535;&#x7EB8;&#x4E66;&#xFF0C;&#x4F7F;&#x7528;&#x8FC7;Bambook&#x3001;Kindle&#x548C;Boox&#xFF0C;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x57FA;&#x4E8E;Android&#x7CFB;&#x7EDF;&#x7684;Boox&#x4EA7;&#x54C1;&#xFF0C;&#x9274;&#x4E8E;&#x5176;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x653E;&#x6027;&#xFF0C;&#x5229;&#x7528;&#x73B0;&#x6709;&#x7684;&#x8BBE;&#x5907;&#x642D;&#x5EFA;&#x4E00;&#x5957;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5B8C;&#x5168;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x7ECF;&#x8FC7;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x6478;&#x7D22;&#xFF0C;&#x6211;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x5957;&#x53EF;&#x8BA9;&#x7535;&#x7EB8;&#x4E66;&#x6210;&#x4E3A;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x7684;&#x65B9;&#x6848;&#x3002;
</p></div><p class="readmore"><a href="/2017/04/29/把电纸书打造成护眼开发神器/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2017/04/17/Hexo博客集成GitBook/">Hexo博客集成GitBook</a></h1><div class="post-meta">2017-04-17</div><div class="post-content"><p>
&#x6211;&#x4F7F;&#x7528;GitBook&#x4E3B;&#x8981;&#x662F;&#x7528;&#x4E8E;&#x6574;&#x7406;&#x5F52;&#x6863;&#x7684;&#xFF0C;&#x8BB0;&#x5F55;&#x7684;&#x5185;&#x5BB9;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x7CFB;&#x7EDF;&#x4E00;&#x70B9;&#xFF0C;&#x96F6;&#x6563;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x4EE5;&#x535A;&#x5BA2;&#x7684;&#x5F62;&#x5F0F;&#x53D1;&#x5E03;&#x3002;&#x6784;&#x5EFA;&#x535A;&#x5BA2;&#x4F7F;&#x7528;&#x7684;Hexo&#x548C;GitBook&#x662F;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#x4E24;&#x5957;&#x7A0B;&#x5E8F;&#xFF0C;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x624B;&#x52A8;&#x96C6;&#x6210;&#x8D77;&#x6765;&#x3002;&#x5C06;&#x535A;&#x5BA2;&#x53D1;&#x5E03;&#x5230;github&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5C06;public&#x76EE;&#x5F55;&#x66F4;&#x65B0;&#x5230;github&#x4E0A;&#x9762;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x6267;&#x884C;hexo g&#x4E4B;&#x540E;&#xFF0C;hexo d&#x4E4B;&#x524D;&#xFF0C;&#x5C06;GitBook&#x7684;&#x5185;&#x5BB9;&#x751F;&#x6210;&#x5230;public&#x76EE;&#x5F55;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;
&#x5728;&#x535A;&#x5BA2;&#x7684;&#x6839;&#x76EE;&#x5F55;&#x5EFA;&#x7ACB;&#x6587;&#x4EF6;&#x5939;books&#xFF0C;GitBook&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x5B58;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#x5B58;&#x653E;&#x4E00;&#x672C;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5728;books&#x76EE;&#x5F55;&#x4E0B;&#x6267;&#x884C;&#x5982;&#x4E0B;&#x7684;GitBook&#x6784;&#x5EFA;&#x811A;&#x672C;&#xFF0C;&#x5373;&#x53EF;&#x5C06;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x5185;&#x5BB9;&#x96C6;&#x6210;&#x5230;Hexo&#x535A;&#x5BA2;&#x5F53;&#x4E2D;&#x3002;
</p></div><p class="readmore"><a href="/2017/04/17/Hexo博客集成GitBook/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2017/03/12/用Wine运行那些你离不开的应用/">用Wine运行那些你离不开的应用</a></h1><div class="post-meta">2017-03-12</div><div class="post-content"><p>
&#x7ECF;&#x5E38;&#x5DE5;&#x4F5C;&#x5728;Linux&#x73AF;&#x5883;&#x91CC;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x4F60;&#x5374;&#x4E0D;&#x5F97;&#x4E0D;&#x5F00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x6216;&#x8005;&#x91CD;&#x542F;&#x5230;window&#x7CFB;&#x7EDF;&#x4E0B;&#xFF0C;&#x7528;&#x4E00;&#x4E0B;Office&#x3001;Photoshop&#x6216;&#x8005;QQ&#x7B49;&#x7B49;&#x3002;&#x4E3A;&#x4E86;&#x4E0D;&#x5E38;&#x7528;&#x7684;&#x51E0;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x5B89;&#x88C5;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x6216;&#x8005;&#x591A;&#x5B89;&#x88C5;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#x592A;&#x9EBB;&#x70E6;&#x592A;&#x6D6A;&#x8D39;&#x7A7A;&#x95F4;&#x4E86;&#x3002;&#x4E8E;&#x662F;&#x60F3;&#x8BD5;&#x8BD5;wine&#xFF0C;&#x7ED3;&#x679C;&#x8FD8;&#x7B97;&#x6EE1;&#x610F;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x5E94;&#x7528;&#x57FA;&#x672C;&#x90FD;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;
</p></div><p class="readmore"><a href="/2017/03/12/用Wine运行那些你离不开的应用/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2016/07/19/将Emacs写作环境转移到Windows/">将Emacs写作环境转移到Windows</a></h1><div class="post-meta">2016-07-19</div><div class="post-content"><p>
Bash on Ubuntu on Windows&#xFF08;&#x7B80;&#x79F0;WSL&#xFF09;&#x53D1;&#x5E03;&#x4E86;&#xFF0C;&#x968F;&#x7740;&#x8FD9;&#x4E2A;subsystem&#x7684;&#x53D1;&#x5E03;&#x548C;&#x5B8C;&#x5584;&#xFF0C;&#x4F30;&#x8BA1;&#x4EE5;&#x540E;Linux&#x53EA;&#x4F1A;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E0A;&#x8DD1;&#x4E86;&#x3002;&#x6211;&#x5F53;&#x7136;&#x5E0C;&#x671B;&#x7528;WSL&#x6765;&#x642D;&#x5EFA;&#x5199;&#x4F5C;&#x73AF;&#x5883;&#xFF0C;&#x4F46;WSL&#x9ED8;&#x8BA4;&#x53EA;&#x63D0;&#x4F9B;&#x5BF9;&#x547D;&#x4EE4;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4E0D;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;GUI&#x7A0B;&#x5E8F;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B89;&#x88C5;xming&#xFF0C;Xmanger&#x7B49;Xserver&#x65B9;&#x6CD5;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;WSL&#x7684;GUI&#x7A0B;&#x5E8F;&#x8DD1;&#x5728;Windows&#x4E0A;&#x3002;emacs&#x4E5F;&#x80FD;&#x6210;&#x529F;&#x5B89;&#x88C5;&#x548C;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;Bash&#x4E0B;&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x4E2D;&#x6587;&#x8F93;&#x5165;&#x3002;&#x8BA9;emacs&#x8DD1;&#x5728;xserver&#x4E0A;&#xFF0C;&#x540C;&#x6837;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8C03;&#x51FA;&#x8F93;&#x5165;&#x6CD5;&#x3002;&#x4F30;&#x8BA1;&#x4EE5;&#x540E;&#x6210;&#x719F;&#x4E86;GUI&#x7A0B;&#x5E8F;&#x8FD8;&#x662F;&#x80FD;&#x591F;&#x8DD1;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x5148;&#x653E;&#x5F03;WSL&#xFF0C;&#x6682;&#x65F6;&#x7528;msys2&#x642D;&#x5EFA;&#x73AF;&#x5883;&#xFF0C;&#x4ECE;&#x7ED3;&#x679C;&#x6765;&#x770B;&#x8FD8;&#x7B97;&#x662F;&#x6EE1;&#x610F;&#x7684;&#x3002;
</p></div><p class="readmore"><a href="/2016/07/19/将Emacs写作环境转移到Windows/">阅读全文</a></p></div><nav class="page-navigator"><span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><a class="page-number" href="/page/3/">3</a><a class="page-number" href="/page/4/">4</a><a class="extend next" rel="next" href="/page/2/">下一页</a></nav></div></div><div class="pure-u-1-4 hidden_mid_and_down"><div id="sidebar"><div class="widget"><form class="search-form" action="//www.google.com/search" method="get" accept-charset="utf-8" target="_blank"><input type="text" name="q" maxlength="20" placeholder="Search"><input type="hidden" name="sitesearch" value="http://wing-ho.github.io"></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/Android/">Android</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Emacs/">Emacs</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Hexo/">Hexo</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/JavaScript/">JavaScript</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Linux/">Linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Python/">Python</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Rapberry-Pi/">Rapberry Pi</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Redis/">Redis</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Router/">Router</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/VirtualBox/">VirtualBox</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Windows/">Windows</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最近文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2018/10/06/redis/">深入理解Redis</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/10/03/逆向PT632_G2光猫固件/">逆向PT632 G2光猫固件</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/10/02/把镜像从KVM迁移到VirtualBox/">把镜像从KVM迁移到VirtualBox</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/05/10/把开发环境装进你的口袋/">把开发环境装进你的口袋</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/05/07/打造兼容BIOS和UEFI的启动盘/">打造兼容BIOS和UEFI的启动盘</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/08/09/批量下载喜马拉雅的免费专辑/">批量下载喜马拉雅的免费专辑</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/04/29/把电纸书打造成护眼开发神器/">把电纸书打造成护眼开发神器</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/04/17/Hexo博客集成GitBook/">Hexo博客集成GitBook</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/03/12/用Wine运行那些你离不开的应用/">用Wine运行那些你离不开的应用</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/07/19/将Emacs写作环境转移到Windows/">将Emacs写作环境转移到Windows</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="https://blog.csdn.net/genrong" title="本人CSDN博客" target="_blank">本人CSDN博客</a><ul></ul><a href="https://blog.codingnow.com" title="云风" target="_blank">云风</a><ul></ul><a href="http://www.ruanyifeng.com/blog" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.yinwang.org" title="王垠" target="_blank">王垠</a></div></div></div><div class="pure-u-1 pure-u-md-3-4"><div id="footer">Copyright © 2018 <a href="/." rel="nofollow">Wing.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div></div></div><a class="show" id="rocket" href="#top"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/3.3.5/jquery.fancybox.min.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/fancybox/3.3.5/jquery.fancybox.min.css"><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>