<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="msvalidate.01" content="882A4E15FB483D0DD65BAC2CD6F114BD"><meta name="description" content="Wing's Blog"><title>Wing | 大道至简</title><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/8.0.0/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/1.0.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/1.0.0/grids-responsive-min.css"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.7.0/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/3.3.1/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">Wing</h1><a id="logo" href="/.">Wing</a><p class="description">大道至简</p></div><div id="nav-menu"><a class="current" href="/."><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/books/"><i class="fa fa-book"> 书籍</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div class="pure-g" id="layout"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title"><a href="/2017/04/17/Hexo博客集成GitBook/">Hexo博客集成GitBook</a></h1><div class="post-meta">2017-04-17</div><a class="disqus-comment-count" data-disqus-identifier="2017/04/17/Hexo博客集成GitBook/" href="/2017/04/17/Hexo博客集成GitBook/#disqus_thread"></a><div class="post-content"><p>
&#x6211;&#x4F7F;&#x7528;GitBook&#x4E3B;&#x8981;&#x662F;&#x7528;&#x4E8E;&#x6574;&#x7406;&#x5F52;&#x6863;&#x7684;&#xFF0C;&#x8BB0;&#x5F55;&#x7684;&#x5185;&#x5BB9;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x7CFB;&#x7EDF;&#x4E00;&#x70B9;&#xFF0C;&#x96F6;&#x6563;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x4EE5;&#x535A;&#x5BA2;&#x7684;&#x5F62;&#x5F0F;&#x53D1;&#x5E03;&#x3002;&#x6784;&#x5EFA;&#x535A;&#x5BA2;&#x4F7F;&#x7528;&#x7684;Hexo&#x548C;GitBook&#x662F;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#x4E24;&#x5957;&#x7A0B;&#x5E8F;&#xFF0C;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x624B;&#x52A8;&#x96C6;&#x6210;&#x8D77;&#x6765;&#x3002;&#x5C06;&#x535A;&#x5BA2;&#x53D1;&#x5E03;&#x5230;github&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5C06;public&#x76EE;&#x5F55;&#x66F4;&#x65B0;&#x5230;github&#x4E0A;&#x9762;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x6267;&#x884C;hexo g&#x4E4B;&#x540E;&#xFF0C;hexo d&#x4E4B;&#x524D;&#xFF0C;&#x5C06;GitBook&#x7684;&#x5185;&#x5BB9;&#x751F;&#x6210;&#x5230;public&#x76EE;&#x5F55;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;
&#x5728;&#x535A;&#x5BA2;&#x7684;&#x6839;&#x76EE;&#x5F55;&#x5EFA;&#x7ACB;&#x6587;&#x4EF6;&#x5939;books&#xFF0C;GitBook&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x5B58;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#x5B58;&#x653E;&#x4E00;&#x672C;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5728;books&#x76EE;&#x5F55;&#x4E0B;&#x6267;&#x884C;&#x5982;&#x4E0B;&#x7684;GitBook&#x6784;&#x5EFA;&#x811A;&#x672C;&#xFF0C;&#x5373;&#x53EF;&#x5C06;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x5185;&#x5BB9;&#x96C6;&#x6210;&#x5230;Hexo&#x535A;&#x5BA2;&#x5F53;&#x4E2D;&#x3002;
</p></div><p class="readmore"><a href="/2017/04/17/Hexo博客集成GitBook/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2017/03/12/用Wine运行那些你离不开的应用/">用Wine运行那些你离不开的应用</a></h1><div class="post-meta">2017-03-12</div><a class="disqus-comment-count" data-disqus-identifier="2017/03/12/用Wine运行那些你离不开的应用/" href="/2017/03/12/用Wine运行那些你离不开的应用/#disqus_thread"></a><div class="post-content"><p>
&#x7ECF;&#x5E38;&#x5DE5;&#x4F5C;&#x5728;Linux&#x73AF;&#x5883;&#x91CC;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x4F60;&#x5374;&#x4E0D;&#x5F97;&#x4E0D;&#x5F00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x6216;&#x8005;&#x91CD;&#x542F;&#x5230;window&#x7CFB;&#x7EDF;&#x4E0B;&#xFF0C;&#x7528;&#x4E00;&#x4E0B;Office&#x3001;Photoshop&#x6216;&#x8005;QQ&#x7B49;&#x7B49;&#x3002;&#x4E3A;&#x4E86;&#x4E0D;&#x5E38;&#x7528;&#x7684;&#x51E0;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x5B89;&#x88C5;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x6216;&#x8005;&#x591A;&#x5B89;&#x88C5;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#x592A;&#x9EBB;&#x70E6;&#x592A;&#x6D6A;&#x8D39;&#x7A7A;&#x95F4;&#x4E86;&#x3002;&#x4E8E;&#x662F;&#x60F3;&#x8BD5;&#x8BD5;wine&#xFF0C;&#x7ED3;&#x679C;&#x8FD8;&#x7B97;&#x6EE1;&#x610F;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x5E94;&#x7528;&#x57FA;&#x672C;&#x90FD;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;
</p></div><p class="readmore"><a href="/2017/03/12/用Wine运行那些你离不开的应用/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2016/09/13/R语言入门/">R语言入门</a></h1><div class="post-meta">2016-09-13</div><a class="disqus-comment-count" data-disqus-identifier="2016/09/13/R语言入门/" href="/2016/09/13/R语言入门/#disqus_thread"></a><div class="post-content"><p>
&#x8001;&#x670B;&#x53CB;&#x53D1;&#x8868;&#x8BBA;&#x6587;&#x9700;&#x8981;&#x7528;&#x5230;R&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x7A7A;&#x95F4;&#x77E5;&#x8BC6;&#x7406;&#x8BBA;&#x7684;&#x76F8;&#x5173;&#x8BA1;&#x7B97;&#x3002;Win 10&#x542F;&#x52A8;RGui&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7BA1;&#x7406;&#x5458;&#x6743;&#x9650;&#x542F;&#x52A8;&#x3002;
</p></div><p class="readmore"><a href="/2016/09/13/R语言入门/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2016/07/19/将Emacs写作环境转移到Windows/">将Emacs写作环境转移到Windows</a></h1><div class="post-meta">2016-07-19</div><a class="disqus-comment-count" data-disqus-identifier="2016/07/19/将Emacs写作环境转移到Windows/" href="/2016/07/19/将Emacs写作环境转移到Windows/#disqus_thread"></a><div class="post-content"><p>
Bash on Ubuntu on Windows&#xFF08;&#x7B80;&#x79F0;WSL&#xFF09;&#x53D1;&#x5E03;&#x4E86;&#xFF0C;&#x968F;&#x7740;&#x8FD9;&#x4E2A;subsystem&#x7684;&#x53D1;&#x5E03;&#x548C;&#x5B8C;&#x5584;&#xFF0C;&#x4F30;&#x8BA1;&#x4EE5;&#x540E;Linux&#x53EA;&#x4F1A;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E0A;&#x8DD1;&#x4E86;&#x3002;&#x6211;&#x5F53;&#x7136;&#x5E0C;&#x671B;&#x7528;WSL&#x6765;&#x642D;&#x5EFA;&#x5199;&#x4F5C;&#x73AF;&#x5883;&#xFF0C;&#x4F46;WSL&#x9ED8;&#x8BA4;&#x53EA;&#x63D0;&#x4F9B;&#x5BF9;&#x547D;&#x4EE4;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4E0D;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;GUI&#x7A0B;&#x5E8F;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B89;&#x88C5;xming&#xFF0C;Xmanger&#x7B49;Xserver&#x65B9;&#x6CD5;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;WSL&#x7684;GUI&#x7A0B;&#x5E8F;&#x8DD1;&#x5728;Windows&#x4E0A;&#x3002;emacs&#x4E5F;&#x80FD;&#x6210;&#x529F;&#x5B89;&#x88C5;&#x548C;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;Bash&#x4E0B;&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x4E2D;&#x6587;&#x8F93;&#x5165;&#x3002;&#x8BA9;emacs&#x8DD1;&#x5728;xserver&#x4E0A;&#xFF0C;&#x540C;&#x6837;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8C03;&#x51FA;&#x8F93;&#x5165;&#x6CD5;&#x3002;&#x4F30;&#x8BA1;&#x4EE5;&#x540E;&#x6210;&#x719F;&#x4E86;GUI&#x7A0B;&#x5E8F;&#x8FD8;&#x662F;&#x80FD;&#x591F;&#x8DD1;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x5148;&#x653E;&#x5F03;WSL&#xFF0C;&#x6682;&#x65F6;&#x7528;msys2&#x642D;&#x5EFA;&#x73AF;&#x5883;&#xFF0C;&#x4ECE;&#x7ED3;&#x679C;&#x6765;&#x770B;&#x8FD8;&#x7B97;&#x662F;&#x6EE1;&#x610F;&#x7684;&#x3002;
</p></div><p class="readmore"><a href="/2016/07/19/将Emacs写作环境转移到Windows/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2016/07/17/玩转Window 10 Bash/">玩转Window 10 Bash</a></h1><div class="post-meta">2016-07-17</div><a class="disqus-comment-count" data-disqus-identifier="2016/07/17/玩转Window 10 Bash/" href="/2016/07/17/玩转Window 10 Bash/#disqus_thread"></a><div class="post-content"><p>
&#x968F;&#x7740;Windows 10&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x7A81;&#x7136;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5438;&#x5F15;&#x6211;&#x7684;&#x7279;&#x6027;Bash On Ubuntu On Windows&#xFF0C;&#x6211;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x6362;&#x56DE;&#x4E86;Windows 10&#xFF0C;&#x597D;&#x597D;&#x4F53;&#x9A8C;&#x4E86;&#x4E00;&#x628A;&#x8FD9;&#x4E2A;&#x4EE4;&#x4EBA;&#x6FC0;&#x52A8;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4F46;&#x662F;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x4E0D;&#x5C11;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;Bash&#x80FD;&#x8DD1;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x5341;&#x5206;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x5C31;&#x8DDF;&#x901A;&#x8FC7;Wine&#x8DD1;&#x5728;Linux&#x7684;&#x5E94;&#x7528;&#x4E00;&#x6837;&#x662F;&#x5341;&#x5206;&#x6709;&#x9650;&#x7684;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x6709;&#x9650;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x7684;&#x865A;&#x62DF;&#x673A;&#x4E0D;&#x7528;&#x518D;&#x600E;&#x4E48;&#x5F00;&#x673A;&#x4E86;&#xFF0C;&#x76EE;&#x524D;Bash&#x7684;&#x5E94;&#x7528;&#x6211;&#x8FD8;&#x5728;&#x63A2;&#x7D22;&#x4E2D;&#x3002;Win 10&#x8FD8;&#x6709;&#x6BD4;&#x8F83;&#x5438;&#x5F15;&#x6211;&#x7684;&#x7684;&#x865A;&#x62DF;&#x684C;&#x9762;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x5728;Linux&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x5F88;&#x4E45;&#x4E86;&#xFF0C;&#x4EE5;&#x524D;&#x603B;&#x60F3;&#x901A;&#x8FC7;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x684C;&#x9762;&#x5B9E;&#x73B0;&#x7C7B;&#x578B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x73B0;&#x5728;&#x7EC8;&#x4E8E;&#x7531;&#x5B98;&#x65B9;&#x5B9E;&#x73B0;&#x4E86;&#x3002;
</p></div><p class="readmore"><a href="/2016/07/17/玩转Window 10 Bash/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2016/07/12/打造安全稳定的服务器运行环境/">打造安全稳定的服务器运行环境</a></h1><div class="post-meta">2016-07-12</div><a class="disqus-comment-count" data-disqus-identifier="2016/07/12/打造安全稳定的服务器运行环境/" href="/2016/07/12/打造安全稳定的服务器运行环境/#disqus_thread"></a><div class="post-content"><p>
&#x6700;&#x8FD1;&#x53D1;&#x73B0;&#x7814;&#x7A76;&#x6240;&#x7684;&#x670D;&#x52A1;&#x5668;&#x53C8;&#x88AB;&#x4EBA;&#x5165;&#x4FB5;&#x4E86;&#xFF0C;&#x4E09;&#x5929;&#x4E24;&#x5934;&#x5C31;&#x6B7B;&#x673A;&#x505C;&#x6B62;&#x670D;&#x52A1;&#x3002;&#x591A;&#x5E74;&#x524D;&#x63A5;&#x624B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x88AB;&#x9ED1;&#x5BA2;&#x5B8C;&#x5168;&#x63A7;&#x5236;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x4E3B;&#x673A;&#xFF0C;&#x6570;&#x636E;&#x8FD8;&#x88AB;&#x6076;&#x610F;&#x7834;&#x574F;&#x4E86;&#xFF0C;&#x624D;&#x627E;&#x5230;&#x6211;&#x5E2E;&#x5FD9;&#x7684;&#x3002;&#x5F53;&#x521D;&#x6211;&#x4E5F;&#x662F;&#x7ECF;&#x8FC7;&#x601D;&#x8003;&#xFF0C;&#x51B3;&#x5B9A;&#x7528;&#x865A;&#x62DF;&#x673A;&#x6765;&#x8FD0;&#x884C;&#x7F51;&#x7AD9;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x4FDD;&#x62A4;&#x5BBF;&#x4E3B;&#x673A;&#x7684;&#x63A7;&#x5236;&#x6743;&#x3002;&#x4E4B;&#x524D;&#x76F4;&#x63A5;&#x5F00;&#x653E;&#x4E3B;&#x673A;&#x7684;&#x7AEF;&#x53E3;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x88AB;&#x9ED1;&#x5BA2;&#x63A7;&#x5236;&#x4E86;&#xFF0C;&#x6211;&#x8FDC;&#x7A0B;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x593A;&#x56DE;&#x63A7;&#x5236;&#x6743;&#x3002;&#x6539;&#x7528;&#x865A;&#x62DF;&#x673A;&#x7684;&#x8BDD;&#xFF0C;&#x5373;&#x4F7F;&#x88AB;&#x5165;&#x4FB5;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x865A;&#x62DF;&#x673A;&#x635F;&#x574F;&#x4E86;&#x800C;&#x5DF2;&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x884C;&#xFF0C;&#x91CD;&#x88C5;&#x7CFB;&#x7EDF;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;
</p></div><p class="readmore"><a href="/2016/07/12/打造安全稳定的服务器运行环境/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2016/07/07/在Linux中运行ASP/">在Linux中运行ASP</a></h1><div class="post-meta">2016-07-07</div><a class="disqus-comment-count" data-disqus-identifier="2016/07/07/在Linux中运行ASP/" href="/2016/07/07/在Linux中运行ASP/#disqus_thread"></a><div class="post-content"><p>
&#x4E00;&#x76F4;&#x5E0C;&#x671B;&#x80FD;&#x627E;&#x5728;Linux&#x73AF;&#x5883;&#x4E0B;&#x8FD0;&#x884C;&#x7684;ASP&#x8FD0;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x4ECA;&#x5929;&#x603B;&#x7B97;&#x5F97;&#x507F;&#x6240;&#x613F;&#xFF0C;&#x5C06;iasp&#x914D;&#x7F6E;&#x6210;&#x529F;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5C06;asp&#x8FC1;&#x79FB;&#x5230;Linux&#x4E3B;&#x673A;&#x5F53;&#x4E2D;&#x6210;&#x4E3A;&#x4E86;&#x53EF;&#x80FD;&#x3002;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x652F;&#x6301;&#x6211;&#x6BD4;&#x8F83;&#x62C5;&#x5FC3;&#x7684;&#x662F;&#x5BF9;Access&#x6570;&#x636E;&#x5E93;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x6709;&#x7EAF;Java&#x5B9E;&#x73B0;&#x7684;UCanAccess&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x5728;Linux&#x5E73;&#x53F0;&#x4E0B;&#x8BBF;&#x95EE;Access&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x3002;&#x53E6;&#x5916;&#x6211;&#x6D4B;&#x8BD5;&#x4E86;&#x4E00;&#x4E0B;iasp&#x5BF9;JScript&#x7684;&#x8BED;&#x6CD5;&#x7684;&#x652F;&#x6301;&#x7A0B;&#x5EA6;&#xFF0C;&#x53D1;&#x73B0;&#x4E0D;&#x652F;&#x6301;&#x533F;&#x540D;&#x51FD;&#x6570;&#xFF0C;&#x539F;&#x578B;&#x94FE;&#x7B49;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x662F;JScript&#x6700;&#x4E3A;&#x5F3A;&#x5927;&#x548C;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x5E76;&#x6CA1;&#x6709;&#x5B9E;&#x65BD;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x771F;&#x6B63;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x65B9;&#x6848;&#x5E94;&#x8BE5;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x3002;&#x968F;&#x7740;&#x81EA;&#x5DF1;&#x5BF9;&#x865A;&#x62DF;&#x673A;&#x7684;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#xFF0C;&#x5E94;&#x5BF9;&#x9057;&#x7559;Window&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x7528;kvm&#x865A;&#x62DF;&#x673A;&#x5E94;&#x8BE5;&#x662F;&#x6700;&#x4F73;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;
</p></div><p class="readmore"><a href="/2016/07/07/在Linux中运行ASP/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2016/06/22/无线中继方案/">无线中继方案</a></h1><div class="post-meta">2016-06-22</div><a class="disqus-comment-count" data-disqus-identifier="2016/06/22/无线中继方案/" href="/2016/06/22/无线中继方案/#disqus_thread"></a><div class="post-content"><p>
&#x53BB;&#x4E2D;&#x56FD;&#x7535;&#x4FE1;&#x54A8;&#x8BE2;&#x4E86;&#x4E00;&#x4E0B;&#x76EE;&#x524D;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#x7684;&#x5BBD;&#x5E26;&#x7684;&#x4EF7;&#x683C;&#x60C5;&#x51B5;&#xFF0C;&#x7B54;&#x590D;&#x6CA1;&#x6709;&#x5149;&#x7EA4;&#xFF0C;&#x53EA;&#x6709;&#x94DC;&#x7F06;&#x6700;&#x9AD8;&#x901F;&#x5EA6;8M&#xFF0C;&#x4E00;&#x5E74;&#x8D39;&#x7528;1700+&#xFF0C;&#x4F5B;&#x5C71;&#x8001;&#x5BB6;&#x7684;50M&#x5149;&#x7EA4;&#xFF0C;&#x624D;900&#x5757;&#x4E00;&#x5E74;&#xFF0C;&#x679C;&#x65AD;&#x4E0D;&#x88C5;&#x5BBD;&#x5E26;&#x3002;&#x90A3;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x4E2D;&#x7EE7;&#x5B66;&#x6821;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x8E6D;&#x4E00;&#x4E0B;&#x90BB;&#x5C45;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x529F;&#x7387;&#x5927;&#x70B9;&#x7684;&#x7F51;&#x5361;&#x548C;&#x5929;&#x7EBF;&#x3002;&#x521D;&#x6B65;&#x8BBE;&#x60F3;&#x6709;&#x4E09;&#x79CD;&#x53EF;&#x884C;&#x7684;&#x65B9;&#x6848;&#xFF1A;
</p></div><p class="readmore"><a href="/2016/06/22/无线中继方案/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2016/04/09/Firefox中文版和英文版的区别/">Firefox中文版和英文版的区别</a></h1><div class="post-meta">2016-04-09</div><a class="disqus-comment-count" data-disqus-identifier="2016/04/09/Firefox中文版和英文版的区别/" href="/2016/04/09/Firefox中文版和英文版的区别/#disqus_thread"></a><div class="post-content"><p>
Google&#x63A8;&#x51FA;Chrome&#x6D4F;&#x89C8;&#x5668;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x90FD;&#x5C06;&#x5B83;&#x4F5C;&#x4E3A;&#x6211;&#x7684;&#x9ED8;&#x8BA4;&#x6D4F;&#x89C8;&#x5668;&#x3002;&#x5728;Windows&#x5E73;&#x53F0;&#x4E0B;&#x9762;&#x5012;&#x6CA1;&#x6709;&#x89C9;&#x5F97;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x8FD1;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x5207;&#x6362;&#x5230;Arch Linux&#x4E4B;&#x540E;&#xFF0C;&#x53D1;&#x73B0;Chrome&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x8F93;&#x5165;&#x7F51;&#x5740;&#x7684;&#x65F6;&#x5019;&#x6709;&#x975E;&#x5E38;&#x660E;&#x663E;&#x7684;&#x5361;&#x987F;&#xFF0C;Google&#x5B98;&#x65B9;&#x9ED8;&#x8BA4;&#x53EA;&#x63D0;&#x4F9B;&#x4E86;deb&#x548C;rpm&#x5B89;&#x88C5;&#x5305;&#xFF0C;&#x53EF;&#x80FD;&#x5BF9;Arch Linux&#x652F;&#x6301;&#x4E0D;&#x662F;&#x5F88;&#x5B8C;&#x5584;&#x3002;&#x6211;&#x8BD5;&#x8FC7;&#x5B89;&#x88C5;&#x5F00;&#x6E90;&#x7248;&#x672C;&#x7684;chromium&#x3001;Opera&#x7B49;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x8F93;&#x5165;&#x7F51;&#x5740;&#x5361;&#x987F;&#x7684;&#x95EE;&#x9898;&#x540C;&#x6837;&#x5B58;&#x5728;&#x3002;&#x6700;&#x540E;&#x6362;&#x56DE;Firefox&#xFF0C;&#x624D;&#x53D1;&#x73B0;Firefox&#x662F;&#x6700;&#x6D41;&#x7545;&#x7684;&#xFF0C;&#x800C;&#x4E14;vimfx&#x63D2;&#x4EF6;&#x6BD4;chrome&#x4E0B;&#x7684;vimium&#x597D;&#x7528;&#xFF0C;&#x5728;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5FEB;&#x6377;&#x952E;&#x4ECD;&#x7136;&#x53EF;&#x7528;&#x3002;
</p></div><p class="readmore"><a href="/2016/04/09/Firefox中文版和英文版的区别/">阅读全文</a></p></div><div class="post"><h1 class="post-title"><a href="/2016/03/29/给宝宝取名字/">给宝宝取名字</a></h1><div class="post-meta">2016-03-29</div><a class="disqus-comment-count" data-disqus-identifier="2016/03/29/给宝宝取名字/" href="/2016/03/29/给宝宝取名字/#disqus_thread"></a><div class="post-content"><p>
&#x6000;&#x4E0A;&#x513F;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x548C;&#x8001;&#x5A46;&#x8FD8;&#x662F;&#x5F02;&#x5730;&#x7684;&#xFF0C;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x521A;&#x597D;&#x5728;&#x521B;&#x4E1A;&#xFF0C;&#x4F5C;&#x4E3A;&#x5408;&#x4F19;&#x4EBA;&#x53CA;&#x6280;&#x672F;&#x8D1F;&#x8D23;&#x4EBA;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x6539;&#x53D8;&#x4E00;&#x4E9B;&#x9519;&#x8BEF;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x800C;&#x4E14;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x91CC;&#x4E5F;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x4EBA;&#x662F;&#x8D1F;&#x8D23;&#x6280;&#x672F;&#x7684;&#xFF0C;&#x522B;&#x4EBA;&#x751A;&#x81F3;&#x4E0D;&#x4E86;&#x89E3;&#x4F60;&#x90FD;&#x505A;&#x4E86;&#x4E9B;&#x4EC0;&#x4E48;&#x3002;&#x8DDF;&#x5408;&#x4F19;&#x4EBA;&#x7ECF;&#x5E38;&#x4F1A;&#x610F;&#x89C1;&#x51B2;&#x7A81;&#xFF0C;&#x5B9E;&#x5728;&#x89C9;&#x5F97;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x4E86;&#xFF0C;&#x8BA4;&#x771F;&#x8003;&#x8651;&#x4E4B;&#x540E;&#xFF0C;&#x9009;&#x62E9;&#x4E86;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#xFF0C;&#x53E6;&#x5BFB;&#x51FA;&#x8DEF;&#x4F1A;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x8F9E;&#x6389;&#x4E86;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E13;&#x5FC3;&#x8D1F;&#x8D23;&#x7167;&#x987E;&#x8001;&#x5A46;&#x3002;&#x56E0;&#x4E3A;&#x8F9E;&#x804C;&#x5728;&#x5BB6;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x601D;&#x8003;&#x7ED9;&#x5B69;&#x5B50;&#x53D6;&#x540D;&#x5B57;&#x7684;&#x4E8B;&#x60C5;&#x3002;
</p></div><p class="readmore"><a href="/2016/03/29/给宝宝取名字/">阅读全文</a></p></div><nav class="page-navigator"><a class="extend prev" rel="prev" href="/">上一页</a><a class="page-number" href="/">1</a><span class="page-number current">2</span><a class="page-number" href="/page/3/">3</a><a class="page-number" href="/page/4/">4</a><a class="extend next" rel="next" href="/page/3/">下一页</a></nav><script id="dsq-count-scr" src="//wing-ho.disqus.com/count.js" async></script></div></div><div class="pure-u-1-4 hidden_mid_and_down"><div id="sidebar"><div class="widget"><form class="search-form" action="//www.google.com/search" method="get" accept-charset="utf-8" target="_blank"><input type="text" name="q" maxlength="20" placeholder="Search"/><input type="hidden" name="sitesearch" value="http://wing-ho.github.io"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/Android/">Android</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Emacs/">Emacs</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Hexo/">Hexo</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/JavaScript/">JavaScript</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Linux/">Linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Nginx/">Nginx</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Python/">Python</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/R/">R</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Rapberry-Pi/">Rapberry Pi</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Redis/">Redis</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Router/">Router</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/SQL-Server/">SQL Server</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/VirtualBox/">VirtualBox</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Windows/">Windows</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最近文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2018/10/07/lnmp/">配置LEMP</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/10/06/redis/">深入理解Redis</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/10/03/逆向PT632_G2光猫固件/">逆向PT632 G2光猫固件</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/10/02/把镜像从KVM迁移到VirtualBox/">把镜像从KVM迁移到VirtualBox</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/05/10/把开发环境装进你的口袋/">把开发环境装进你的口袋</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/05/10/玩转电视盒子/">玩转电视盒子</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/05/07/打造兼容BIOS和UEFI的启动盘/">打造兼容BIOS和UEFI的启动盘</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/08/09/批量下载喜马拉雅的免费专辑/">批量下载喜马拉雅的免费专辑</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/05/09/安装和配置Debian系操作系统/">安装和配置Debian系操作系统</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/04/29/把电纸书打造成护眼开发神器/">把电纸书打造成护眼开发神器</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-comment-o"> 最近评论</i></div><script type="text/javascript" src="//wing-ho.disqus.com/recent_comments_widget.js?num_items=5&amp;hide_avatars=1&amp;avatar_size=32&amp;excerpt_length=20&amp;hide_mods=1"></script></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="https://blog.csdn.net/genrong" title="本人CSDN博客" target="_blank">本人CSDN博客</a><ul></ul><a href="https://blog.codingnow.com" title="云风" target="_blank">云风</a><ul></ul><a href="http://www.ruanyifeng.com/blog" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.yinwang.org" title="王垠" target="_blank">王垠</a></div></div></div><div class="pure-u-1 pure-u-md-3-4"><div id="footer">Copyright © 2018 <a href="/." rel="nofollow">Wing.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div></div></div><a class="show" id="rocket" href="#top"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/3.3.5/jquery.fancybox.min.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/fancybox/3.3.5/jquery.fancybox.min.css"><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script><script type="text/javascript" src="/js/toc4org.js?v=0.0.0"></script></div></body></html>